In [1]:
import numpy as np
import pandas as pd

In [2]:
newdf = pd.DataFrame(np.random.rand(334,5) , index = np.arange(334))
newdf

            0         1         2         3         4
0    0.240498  0.912403  0.197554  0.492330  0.366163
1    0.080338  0.163707  0.474330  0.158039  0.784250
2    0.918146  0.768228  0.908561  0.711137  0.249233
3    0.700905  0.643587  0.529343  0.271907  0.295949
4    0.385284  0.413505  0.173123  0.023843  0.808556
..        ...       ...       ...       ...       ...
329  0.192880  0.377559  0.752860  0.009121  0.175846
330  0.511211  0.493422  0.692851  0.807598  0.460314
331  0.453480  0.072214  0.141035  0.627179  0.036696
332  0.713726  0.348436  0.025039  0.214104  0.328454
333  0.427826  0.966414  0.418855  0.339287  0.718968

[334 rows x 5 columns]

In [4]:
newdf.columns = list("ABCDE")

In [5]:
newdf['E'] = None
newdf

            A         B         C         D     E
0    0.240498  0.912403  0.197554  0.492330  None
1    0.080338  0.163707  0.474330  0.158039  None
2    0.918146  0.768228  0.908561  0.711137  None
3    0.700905  0.643587  0.529343  0.271907  None
4    0.385284  0.413505  0.173123  0.023843  None
..        ...       ...       ...       ...   ...
329  0.192880  0.377559  0.752860  0.009121  None
330  0.511211  0.493422  0.692851  0.807598  None
331  0.453480  0.072214  0.141035  0.627179  None
332  0.713726  0.348436  0.025039  0.214104  None
333  0.427826  0.966414  0.418855  0.339287  None

[334 rows x 5 columns]

In [6]:
df = pd.DataFrame(
{
    "name":['Alfed' , 'Batman','Catwomen'],
    "toy":[np.nan , 'Batmobile','Bullwhip'],
    "born":[pd.NaT , pd.Timestamp("2024-07-09"),pd.NaT]
})

In [7]:
df.head()

       name        toy       born
0     Alfed        NaN        NaT
1    Batman  Batmobile 2024-07-09
2  Catwomen   Bullwhip        NaT

In [8]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 2024-07-09

In [9]:
df.dropna(how='all')

       name        toy       born
0     Alfed        NaN        NaT
1    Batman  Batmobile 2024-07-09
2  Catwomen   Bullwhip        NaT

In [10]:
df2 = pd.DataFrame(
{
    "name":['Alfed' , 'Batman','Catwomen'],
    "toy":[np.nan , np.nan , np.nan],
    "born":[pd.NaT , pd.Timestamp("2024-07-09"),pd.NaT]
})

In [11]:
df2.head()

       name  toy       born
0     Alfed  NaN        NaT
1    Batman  NaN 2024-07-09
2  Catwomen  NaN        NaT

In [13]:
df2.dropna(how='all')

       name  toy       born
0     Alfed  NaN        NaT
1    Batman  NaN 2024-07-09
2  Catwomen  NaN        NaT

In [14]:
df2.dropna(how='all' ,axis=1)

       name       born
0     Alfed        NaT
1    Batman 2024-07-09
2  Catwomen        NaT

In [16]:
df3 = pd.DataFrame(
{
    "name":['Alfed' , 'Batman','Alfed'],
    "toy":[np.nan , 'Batmobile','Bullwhip'],
    "born":[pd.NaT , pd.Timestamp("2024-07-09"),pd.NaT]
})

In [17]:
df3.head()

     name        toy       born
0   Alfed        NaN        NaT
1  Batman  Batmobile 2024-07-09
2   Alfed   Bullwhip        NaT

In [19]:
df3.dropna(how='all' ,axis=1)

     name        toy       born
0   Alfed        NaN        NaT
1  Batman  Batmobile 2024-07-09
2   Alfed   Bullwhip        NaT

In [21]:
df3.drop_duplicates(subset=['name'])

     name        toy       born
0   Alfed        NaN        NaT
1  Batman  Batmobile 2024-07-09

In [22]:
df3.drop_duplicates(subset=['name'] , keep = 'first')

     name        toy       born
0   Alfed        NaN        NaT
1  Batman  Batmobile 2024-07-09

In [23]:
df3.drop_duplicates(subset=['name'] , keep = 'last')

     name        toy       born
1  Batman  Batmobile 2024-07-09
2   Alfed   Bullwhip        NaT

In [24]:
df3.drop_duplicates(subset=['name'] , keep = False)

     name        toy       born
1  Batman  Batmobile 2024-07-09

In [26]:
df.shape

(3, 3)

In [27]:
df2.shape

(3, 3)

In [28]:
df3.shape

(3, 3)

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 200.0+ bytes

In [30]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     0 non-null      float64
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 200.0+ bytes

In [31]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 200.0+ bytes

In [32]:
df['toy'].value_counts(dropna=False)

NaN          1
Batmobile    1
Bullwhip     1
Name: toy, dtype: int64

In [33]:
data = pd.read_excel('data.xls' , sheet_name=sheet1)

In [34]:
data

   Train No.  Speed     City
0      17672    356  Aligarh
1      72827    345     Agra
2     425671    267  Aligarh
3     526272    897    Delhi
4      53637    673     Agra